{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "keras_layer_1_input"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_1", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/google/imagenet/mobilenet_v1_100_224/classification/1", "signature": "default", "output_key": "default"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 120, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "dense_1/kernel", "shape": [1001, 120], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [120], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_0/weights", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_pointwise/weights", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/gamma", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/beta", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_pointwise/weights", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_pointwise/weights", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/gamma", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/beta", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_pointwise/weights", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_pointwise/weights", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/gamma", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/beta", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_pointwise/weights", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_pointwise/weights", "shape": [1, 1, 512, 512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "shape": [3, 3, 512, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/gamma", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/beta", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_pointwise/weights", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/beta", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "shape": [3, 3, 1024, 1], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/beta", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_pointwise/weights", "shape": [1, 1, 1024, 1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/gamma", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/beta", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/weights", "shape": [1, 1, 1024, 1001], "dtype": "float32"}, {"name": "MobilenetV1/Logits/Conv2d_1c_1x1/biases", "shape": [1001], "dtype": "float32"}]}]}